In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = {"name" : ["kangsanha", "kangsansoon"], "age" : [18, 19], "sex" : ["male", "female"]}

In [3]:
df = pd.DataFrame(data,columns=["name", "age", "sex"])

In [4]:
df

          name  age     sex
0    kangsanha   18    male
1  kangsansoon   19  female

In [5]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head()

          name  age     sex
0    kangsanha   18    male
1  kangsansoon   19  female

In [6]:
# head의 매개변수 값으로 보여주는 줄을 조절할 수 있다.
df.head(1)

        name  age   sex
0  kangsanha   18  male

In [9]:
# dataframe index
df.index

RangeIndex(start=0, stop=2, step=1)

In [10]:
df.columns

Index(['name', 'age', 'sex'], dtype='object')

In [11]:
df.values

array([['kangsanha', 18, 'male'],
       ['kangsansoon', 19, 'female']], dtype=object)

In [12]:
df.value_counts

<bound method DataFrame.value_counts of           name  age     sex
0    kangsanha   18    male
1  kangsansoon   19  female>

In [13]:
# dataframe에 대한 전체적인 요약정보 보여주는 함수
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   sex     2 non-null      object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [14]:
# dataframe에 대한 전체적인 통계정보 보여주기
df.describe()

             age
count   2.000000
mean   18.500000
std     0.707107
min    18.000000
25%    18.250000
50%    18.500000
75%    18.750000
max    19.000000

In [16]:
# column age를 기준으로 내림차순 정렬, ascending은 오름/내림차순
df.sort_values(by="age", ascending=False)

          name  age     sex
1  kangsansoon   19  female
0    kangsanha   18    male